TOPIC_NAME = "course-enrollments"
BOOTSTRAP_SERVERS = ["kafka:9092"]

COURSES = {
    "OS101": {"name": "운영체제", "capacity": 15},
    "CA101": {"name": "컴퓨터구성", "capacity": 20},
    "CN101": {"name": "컴퓨터네트워크", "capacity": 12},
    "DB101": {"name": "데이터베이스", "capacity": 17},
    "DW101": {"name": "데이터랭글링", "capacity": 10},
}

STUDENTS = [
    "호날두", "메시", "네이마르", "손흥민", "음바페",
    "톰하디", "젠데이아", "티모시샬라메", "포스트말론", "아리아나그란데",
    "두아리파", "뷔", "카리나", "변우석", "아이유",
    "르브론제임스", "커리", "오타니", "저스틴비버", "테일러스위프트",
    "키아누리브스", "라이언고슬링", "마고로비", "잭블랙", "덴젤워싱턴",
]